
class 獲得鑽石():
    def __init__(self, 獲得鑽石數量):
        self.獲得鑽石數量 ="鑽石:"+ 獲得鑽石數量+ '顆'

class 禮包名稱():
    def __init__(self, 禮包名稱文字):
        self.禮包名稱文字 = 禮包名稱文字+ '- '

class 禮包金額():
    def __init__(self, 禮包金額數量):
         self.禮包金額數量 = '價格:'  + 禮包金額數量  

class 一份禮包():
    def __init__(self,禮包名稱, 獲得鑽石, 禮包金額):
        self.a = 禮包名稱 
        self.b = 禮包金額
        self.c = 獲得鑽石
    def about(self):
        print(' ===========================================\n'+ '|',self.a.禮包名稱文字, self.b.禮包金額數量,
         ' ', self.c.獲得鑽石數量, '|'+'\n ===========================================')

A價格 = 830
a = 1150 + 450
b = 120*28
B價格 = 270
d = 340 + 60
e = 40 * 28
附加 = 40*28

禮包名稱物件 = 禮包名稱('每日鑽石月費禮包')
禮包金額物件 = 禮包金額(str(A價格))
獲得鑽石物件 = 獲得鑽石(str(a+b))
一份禮包物件 = 一份禮包(禮包名稱物件,獲得鑽石物件,禮包金額物件)
一份禮包物件.about()
禮包名稱物件 = 禮包名稱('每日狩獵月費禮包')
禮包金額物件 = 禮包金額(str(B價格))
獲得鑽石物件 = 獲得鑽石(str(d+e))
一份禮包物件 = 一份禮包(禮包名稱物件,獲得鑽石物件,禮包金額物件)
一份禮包物件.about()
禮包名稱物件 = 禮包名稱('   總和  ')
禮包金額物件 = 禮包金額(str(A價格 + B價格))
獲得鑽石物件 = 獲得鑽石("Bonus "+str(a+b+d+e+附加))
一份禮包物件 = 一份禮包(禮包名稱物件,獲得鑽石物件,禮包金額物件)
一份禮包物件.about()